/**
  ******************************************************************************
  * 文件名程: led_task.c
  * 作    者: 浩然
  * 版    本: V1.0
  * 编写日期: 2024-03-29
  * 功    能: 进行led的周期闪烁，表示工作
  ******************************************************************************
  */
/* 包含头文件 ----------------------------------------------------------------*/
#include "usart_drv.h"

int fputc(int ch, FILE *f)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xffff);
  return ch;
}
 

int fgetc(FILE *f)
{
  uint8_t ch = 0;
  HAL_UART_Receive(&huart1, &ch, 1, 0xffff);
  return ch;
}




/******** (C) COPYRIGHT 2024 深圳市曼恩斯特科技股份有限公司 *****END OF FILE****/
